const DISTRICT_NAMES_RU = {

    /* =========================
       АНДИЖАНСКАЯ ОБЛАСТЬ
    ========================= */

    "Oltinko'l": "Алтынкульский район",
    "Oltinkul": "Алтынкульский район",
    "Andijon": "Андижанский район",
    "Asaka": "Асакинский район",
    "Baliqchi": "Балыкчинский район",
    "Bo'z": "Бозский район",
    "Boz": "Бозский район",
    "Buloqboshi": "Булакбашинский район",
    "Jalaquduq": "Джалакудукский район",
    "Izboskan": "Избасканский район",
    "Qo'rg'ontepa": "Кургантепинский район",
    "Qorgontepa": "Кургантепинский район",
    "Marhamat": "Мархаматский район",
    "Paxtaobod": "Пахтаабадский район",
    "Ulug'nor": "Улугнорский район",
    "Ulugnor": "Улугнорский район",
    "Xo'jaobod": "Ходжаабадский район",
    "Xojaobod": "Ходжаабадский район",
    "Shahrixon": "Шахриханский район",


    /* =========================
       БУХАРСКАЯ ОБЛАСТЬ
    ========================= */

    "Olot": "Алатский район",
    "Buxoro": "Бухарский район",
    "Vobkent": "Вабкентский район",
    "G'ijduvon": "Гиждуванский район",
    "Gijduvon": "Гиждуванский район",
    "Jondor": "Жондорский район",
    "Kogon": "Каганский район",
    "Qorako'l": "Каракульский район",
    "Qorakul": "Каракульский район",
    "Qorovulbozor": "Караулбазарский район",
    "Peshku": "Пешкунский район",
    "Romitan": "Ромитанский район",
    "Shofirkon": "Шафирканский район",


    /* =========================
       ДЖИЗАКСКАЯ ОБЛАСТЬ
    ========================= */

    "Arnasoy": "Арнасайский район",
    "Baxmal": "Бахмальский район",
    "G'allaorol": "Галляаральский район",
    "Gallaorol": "Галляаральский район",
    "Do'stlik": "Дустликский район",
    "Dostlik": "Дустликский район",
    "Zomin": "Зааминский район",
    "Zarbdor": "Зарбдарский район",
    "Zafarobod": "Зафарабадский район",
    "Mirzacho'l": "Мирзачульский район",
    "Mirzachol": "Мирзачульский район",
    "Paxtakor": "Пахтакорский район",
    "Forish": "Фаришский район",
    "Sharof Rashidov": "Шараф-Рашидовский район",
    "Yangiobod": "Янгиабадский район",


    /* =========================
       КАШКАДАРЬИНСКАЯ ОБЛАСТЬ
    ========================= */

    "G'uzor": "Гузарский район",
    "Guzor": "Гузарский район",
    "Dehqonobod": "Дехканабадский район",
    "Qamashi": "Камашинский район",
    "Qarshi": "Каршинский район",
    "Koson": "Касанский район",
    "Kasbi": "Касбийский район",
    "Kitob": "Китабский район",
    "Mirishkor": "Миришкорский район",
    "Muborak": "Мубарекский район",
    "Nishon": "Нишанский район",
    "Chiroqchi": "Чиракчинский район",
    "Shahrisabz": "Шахрисабзский район",
    "Yakkabog'": "Яккабагский район",
    "Yakkabog": "Яккабагский район",


    /* =========================
       НАВОИЙСКАЯ ОБЛАСТЬ
    ========================= */

    "Konimex": "Канимехский район",
    "Karman": "Карманинский район",
    "Qiziltepa": "Кызылтепинский район",
    "Navbahor": "Навбахорский район",
    "Nurota": "Нуратинский район",
    "Tomdi": "Тамдынский район",
    "Uchquduq": "Учкудукский район",
    "Xatirchi": "Хатырчинский район",


    /* =========================
       НАМАНГАНСКАЯ ОБЛАСТЬ
    ========================= */

    "Kosonsoy": "Касансайский район",
    "Mingbuloq": "Мингбулакский район",
    "Namangan": "Наманганский район",
    "Norin": "Нарынский район",
    "Pop": "Папский район",
    "To'raqo'rg'on": "Туракурганский район",
    "Toraqorgon": "Туракурганский район",
    "Uychi": "Уйчинский район",
    "Uchqo'rg'on": "Учкурганский район",
    "Uchqorgon": "Учкурганский район",
    "Chortoq": "Чартакский район",
    "Chust": "Чустский район",
    "Yangiqo'rg'on": "Янгикурганский район",
    "Yangiqorgon": "Янгикурганский район",


    /* =========================
       САМАРКАНДСКАЯ ОБЛАСТЬ
    ========================= */

    "Oqdaryo": "Акдарьинский район",
    "Bulung'ur": "Булунгурский район",
    "Bulungur": "Булунгурский район",
    "Jomboy": "Джамбайский район",
    "Ishtixon": "Иштыханский район",
    "Kattaqo'rg'on": "Каттакурганский район",
    "Kattaqorgon": "Каттакурганский район",
    "Qo'shrabot": "Кошрабадский район",
    "Qoshrabot": "Кошрабадский район",
    "Narpay": "Нарпайский район",
    "Nurobod": "Нурабадский район",
    "Payariq": "Пайарыкский район",
    "Pastdarg'om": "Пастдаргомский район",
    "Pastdargom": "Пастдаргомский район",
    "Paxtachi": "Пахтачийский район",
    "Samarqand": "Самаркандский район",
    "Toyloq": "Тайлакский район",
    "Urgut": "Ургутский район",


    /* =========================
       СУРХАНДАРЬИНСКАЯ ОБЛАСТЬ
    ========================= */

    "Oltinsoy": "Алтынсайский район",
    "Angor": "Ангорский район",
    "Boysun": "Байсунский район",
    "Bandixon": "Бандиханский район",
    "Denov": "Денауский район",
    "Jarqo'rg'on": "Джаркурганский район",
    "Jarqugon": "Джаркурганский район",
    "Qiziriq": "Кизирикский район",
    "Qumqo'rg'on": "Кумкурганский район",
    "Qumqorgon": "Кумкурганский район",
    "Muzrabot": "Музрабадский район",
    "Sariosiyo": "Сариасийский район",
    "Termiz": "Термезский район",
    "Uzun": "Узунский район",
    "Sherobod": "Шерабадский район",
    "Sho'rchi": "Шурчинский район",
    "Shorchi": "Шурчинский район",


    /* =========================
       СЫРДАРЬИНСКАЯ ОБЛАСТЬ
    ========================= */

    "Oqoltin": "Акалтынский район",
    "Boyovut": "Баяутский район",
    "Guliston": "Гулистанский район",
    "Mirzaobod": "Мирзаабадский район",
    "Sayxunobod": "Сайхунабадский район",
    "Sardoba": "Сардобский район",
    "Sirdaryo": "Сырдарьинский район",
    "Xovos": "Хавастский район",


    /* =========================
       ТАШКЕНТСКАЯ ОБЛАСТЬ
    ========================= */

    "Oqqo'rg'on": "Аккурганский район",
    "Oqqorgon": "Аккурганский район",

    "Ohangaron": "Ахангаранский район",
    "Okhangaron": "Ахангаранский район",
    "Ohangaron District": "Ахангаранский район",
    "Okhangaron District": "Ахангаранский район",

    "Bekobod": "Бекабадский район",

    "Bo'stonliq": "Бостанлыкский район",
    "Bostanliq": "Бостанлыкский район",
    "Bostanliq District": "Бостанлыкский район",

    "Bo'ka": "Букинский район",
    "Boka": "Букинский район",

    "Zangiota": "Зангиатинский район",

    "Qibray": "Кибрайский район",

    "Quyichirchiq": "Куйичирчикский район",

    "Parkent": "Паркентский район",

    "Piskent": "Пскентский район",

    "Toshkent": "Ташкентский район",

    "O'rtachirchiq": "Уртачирчикский район",
    "Ortachirchiq": "Уртачирчикский район",
    "Orta Chirchiq": "Уртачирчикский район",
    "Orta Chirchiq District": "Уртачирчикский район",

    "Chinoz": "Чиназский район",

    "Yuqorichirchiq": "Юкоричирчикский район",

    "Yangiyo'l": "Янгиюльский район",
    "Yangiyol": "Янгиюльский район",


    /* =========================
       ФЕРГАНСКАЯ ОБЛАСТЬ
    ========================= */

    "Oltiariq": "Алтыарыкский район",

    "Bag'dod": "Багдадский район",
    "Bagdod": "Багдадский район",

    "Beshariq": "Бешарыкский район",

    "Buvayda": "Бувайдинский район",

    "Dang'ara": "Дангаринский район",
    "Dangara": "Дангаринский район",
    "Dangara District": "Дангаринский район",

    "Quva": "Кувинский район",

    "Qo'shtepa": "Куштепинский район",
    "Qoshtepa": "Куштепинский район",

    "Rishton": "Риштанский район",

    "So'x": "Сохский район",
    "Sox": "Сохский район",

    "Toshloq": "Ташлакский район",

    "O'zbekiston": "Узбекистанский район",
    "Ozbekiston": "Узбекистанский район",

    "Uchko'prik": "Учкуприкский район",
    "Uchkoprik": "Учкуприкский район",

    "Farg'ona": "Ферганский район",
    "Fargona": "Ферганский район",

    "Furqat": "Фуркатский район",

    "Yozyovon": "Язъяванский район",


    /* =========================
       ХОРЕЗМСКАЯ ОБЛАСТЬ
    ========================= */

    "Bog'ot": "Багатский район",
    "Bogot": "Багатский район",

    "Gurlan": "Гурленский район",

    "Qo'shko'pir": "Кошкупырский район",
    "Qoshkopir": "Кошкупырский район",

    "Urganch": "Ургенчский район",

    "Xazorasp": "Хазараспский район",

    "Xonqa": "Ханкинский район",

    "Xiva": "Хивинский район",

    "Shovot": "Шаватский район",

    "Yangiariq": "Янгиарыкский район",

    "Yangibozor": "Янгибазарский район",


    /* =========================
       КАРАКАЛПАКСТАН
    ========================= */

    "Amudaryo": "Амударьинский район",
    "Beruniy": "Берунийский район",
    "Qorao'zak": "Караузякский район",
    "Qoraozak": "Караузякский район",
    "Kegeyli": "Кегейлийский район",
    "Qo'ng'irot": "Кунградский район",
    "Qongirot": "Кунградский район",
    "Qanliko'l": "Канлыкульский район",
    "Qanlikol": "Канлыкульский район",
    "Mo'ynoq": "Муйнакский район",
    "Moynoq": "Муйнакский район",
    "Nukus": "Нукусский район",
    "Taxiatosh": "Тахиаташский район",
    "Taxtako'pir": "Тахтакупырский район",
    "Taxtakopir": "Тахтакупырский район",
    "To'rtko'l": "Турткульский район",
    "Tortkol": "Турткульский район",
    "Xo'jayli": "Ходжейлийский район",
    "Xojayli": "Ходжейлийский район",
    "Chimboy": "Чимбайский район",
    "Shumanay": "Шуманайский район",
    "Ellikqala": "Элликкалинский район",


    /* =========================
       ГОРОД ТАШКЕНТ
    ========================= */

    "Olmazor": "Алмазарский район",
    "Bektemir": "Бектемирский район",
    "Mirobod": "Мирабадский район",
    "Mirzo Ulug'bek": "Мирзо-Улугбекский район",
    "Mirzo Ulugbek": "Мирзо-Улугбекский район",
    "Sirg'ali": "Сергелийский район",
    "Sirgali": "Сергелийский район",
    "Uchtepa": "Учтепинский район",
    "Yashnobod": "Яшнабадский район",
    "Chilonzor": "Чиланзарский район",
    "Shayxontohur": "Шайхантахурский район",
    "Yunusobod": "Юнусабадский район",
    "Yakkasaroy": "Яккасарайский район"

};